* average income of Alasks in all years
* average income of all states in 2012
* Create a function to print all columns in a single line
* Create a function to access a row based on a unique column value 
* Create a function to average income of all states from 2005 to 2013
* Create a function to the larest average income in the last three years
* Create a function to find the lowest average income form 2007 to 2010(inclusive)
* Print the list of all states in the same line with average income less than calfornia
* Print the names of states based on descending order of their averages in the year 2009
* state the lowest recorded income from 2005 to 2013

In [2]:
import pandas as p
income=p.read_csv('income.csv')
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [3]:
income.head()# shows the values of top of the table

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [4]:
income.tail()# shows the values of bottom of the table

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

## 1 . average income of Alasks in all years

In [7]:
income['State'][0]

0       Alabama
1        Alaska
2       Arizona
3      Arkansas
4    California
Name: State, dtype: object

In [11]:
income['2005'][0]

37150

In [15]:
x=list(income.columns[2:])
x

['2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013']

In [17]:
c=0
s=0
for i in x:
    s=s+income[i][1]
    c+=1
print(s/c)

60106.555555555555

# 2 . average income of all states in 2012

In [19]:
income['2012'].mean()

50038.8

# 3 . Create a function to print all columns in a single line

In [26]:
def pc():
    print(income.columns.tolist())
    return
pc()

['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013']

# 4 . Create a function to access a row based on a unique column value

In [24]:
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [32]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [43]:
for i in income:
    print(list(income[i][0]))

['0', '4', '0', '0', '0', 'U', 'S', '0', '1']
['A', 'l', 'a', 'b', 'a', 'm', 'a']

TypeError: 'numpy.int64' object is not iterable

In [41]:
income.values[0]

array(['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
       42590, 43464, 41381], dtype=object)

In [42]:
c=0
x='04000US06'
for i in income:
    if x in income[i][c]:
        print(income.values[c])
    c+=1

TypeError: argument of type 'numpy.int64' is not iterable

In [51]:
for i in income:
    print(income.values[i],end='')

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [52]:
def fetchcol(num):
    return income.values[num]

n=int(input())
print(fetchcol(n))

1
['04000US02' 'Alaska' 55891 56418 62993 63989 61604 57848 57431 63648
 61137]

# 5 . Create a function to average income of all states from 2005 to 2013

In [62]:
def avginc05to13():
    x=income.columns[2:]
    print('len of x : ',len(x))
    s=0
    for i in x:
        s+=income[i].mean()
        print('Average of ',i,' is ',income[i].mean())
    return s/(len(x))

print('Average income of all states from 2005 to 2013',avginc05to13())

len of x :  9
Average of  2005  is  45339.8
Average of  2006  is  46680.6
Average of  2007  is  49789.8
Average of  2008  is  50395.8
Average of  2009  is  47999.0
Average of  2010  is  47709.4
Average of  2011  is  48662.2
Average of  2012  is  50038.8
Average of  2013  is  50113.4
Average income of all states from 2005 to 2013 48525.42222222223

# 6 . Create a function to the larest average income in the last three years

In [63]:
def largeavgoflast3years():
    x=income.columns[-3:]
    big=income[x[0]].mean()
    for i in x:
        t=income[i].mean()
        if t>big:
            big=t
    return big

print(largeavgoflast3years())

50113.4

# 7 .  Create a function to find the lowest average income form 2007 to 2010(inclusive)

In [64]:
def lowestavgof07to10():
    x=income.columns[4:8]
    sm=income[x[0]].mean()
    for i in x:
        t=income[i].mean()
        if t<sm:
            sm=t
    return sm

print(lowestavgof07to10())

47709.4

# 8 .  Print the list of all states in the same line with average income less than calfornia

In [65]:
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [68]:
income.values[-1][2:].mean()
# California avreage income

55350.444444444445

In [80]:
# all states average income
for i in range(len(income)):
    print(income.values[i][1],'\t',income.values[i][2:].mean())

Alabama 	 41126.444444444445
Alaska 	 60106.555555555555
Arizona 	 47214.77777777778
Arkansas 	 38828.88888888889
California 	 55350.444444444445

In [82]:
c=income.values[-1][2:].mean()
for i in range(len(income)):
    if c>income.values[i][2:].mean():
        print(income.values[i][1],'\t',income.values[i][2:].mean())

Alabama 	 41126.444444444445
Arizona 	 47214.77777777778
Arkansas 	 38828.88888888889

# 9 .  Print the names of states based on descending order of their averages

In [94]:
len(income),dir(d)

(5,
 ['__class__',
  '__contains__',
  '__delattr__',
  '__delitem__',
  '__dir__',
  '__doc__',
  '__eq__',
  '__format__',
  '__ge__',
  '__getattribute__',
  '__getitem__',
  '__gt__',
  '__hash__',
  '__init__',
  '__init_subclass__',
  '__iter__',
  '__le__',
  '__len__',
  '__lt__',
  '__ne__',
  '__new__',
  '__reduce__',
  '__reduce_ex__',
  '__repr__',
  '__setattr__',
  '__setitem__',
  '__sizeof__',
  '__str__',
  '__subclasshook__',
  'clear',
  'copy',
  'fromkeys',
  'get',
  'items',
  'keys',
  'pop',
  'popitem',
  'setdefault',
  'update',
  'values'])

In [100]:
d={}
for i in range(len(income)):
    d[income.values[i][1]]=income.values[i][2:].mean()
   # print(income.values[i][1],'\t',income.values[i][2:].mean(),sep='\t')
print(d)
print()
print(list(d.values()))

{'Alabama': 41126.444444444445, 'Alaska': 60106.555555555555, 'Arizona': 47214.77777777778, 'Arkansas': 38828.88888888889, 'California': 55350.444444444445}

[41126.444444444445, 60106.555555555555, 47214.77777777778, 38828.88888888889, 55350.444444444445]





# 10 .  state the lowest recorded income from 2005 to 2013

In [87]:
x=income.columns[2:]
sm=income[x[0]].min()
for i in x:
    t=income[i].min()
    if t<sm:
        sm=t
print(sm)

36538